bench/results/server1/2/apiary-0.15.0/PARAM.log
Benchmarking PARAM
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.73ms    3.59ms  34.66ms   87.56%
    Req/Sec    17.98k     1.17k   21.41k    68.53%
  1044651 requests in 30.00s, 177.33MB read
Requests/sec:  34822.14
Transfer/sec:      5.91MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.83ms    3.21ms  28.03ms   76.13%
    Req/Sec    18.06k     2.85k   25.44k    56.74%
  1039453 requests in 30.00s, 176.45MB read
Requests/sec:  34648.66
Transfer/sec:      5.88MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.74ms    3.10ms  26.90ms   85.38%
    Req/Sec    17.95k     1.25k   22.29k    70.72%
  1043085 requests in 30.00s, 177.07MB read
Requests/sec:  34769.88
Transfer/sec:      5.90MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.74ms    3.01ms  28.73ms   86.47%
    Req/Sec    17.96k     1.17k   21.56k    71.68%
  1040730 requests in 30.00s, 176.67MB read
Requests/sec:  34691.17
Transfer/sec:      5.89MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.76ms    3.52ms  26.22ms   83.28%
    Req/Sec    17.99k     1.28k   21.70k    68.03%
  1045272 requests in 30.00s, 177.44MB read
Requests/sec:  34842.57
Transfer/sec:      5.91MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.78ms    1.03ms  22.77ms   89.46%
    Req/Sec    17.78k     1.01k   22.74k    71.47%
  1036828 requests in 30.00s, 176.01MB read
Requests/sec:  34561.23
Transfer/sec:      5.87MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.93ms    3.34ms  29.03ms   66.07%
    Req/Sec    17.91k     2.98k   25.06k    59.05%
  1038185 requests in 30.00s, 176.24MB read
Requests/sec:  34606.31
Transfer/sec:      5.87MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.87ms    2.19ms  26.90ms   76.07%
    Req/Sec    17.97k     2.41k   25.08k    60.52%
  1031023 requests in 30.00s, 175.02MB read
Requests/sec:  34367.62
Transfer/sec:      5.83MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.89ms    2.47ms  27.55ms   72.30%
    Req/Sec    17.92k     2.77k   25.13k    61.29%
  1036420 requests in 30.00s, 175.94MB read
Requests/sec:  34546.96
Transfer/sec:      5.86MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/echo/plain/hello/12
  2 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.98ms    2.29ms  26.40ms   65.31%
    Req/Sec    17.89k     3.27k   27.14k    54.57%
  1027182 requests in 30.00s, 174.37MB read
Requests/sec:  34239.80
Transfer/sec:      5.81MB
=================== summary ===================
ghc version:  7.8.2
bench target: apiary-0.15.0
bench:        PARAM
bench mode:   30s * 10
average:      34609.63
stdev:        192.90
=================== oneline ===================
7.8.2,apiary-0.15.0,PARAM,30s,10,34609.63,192.90